---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipingSystemType.SingleLineJunctionDropType
source: html/2aba94f0-3f47-a7d5-b744-40e6dc1325af.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystemType.SingleLineJunctionDropType Property

Symbol for a 1 line junction drop

## Syntax (C#)
```csharp
public RiseDropSymbol SingleLineJunctionDropType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input is not a valid piping rise/drop symbol type.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration